#include <stdio.h>
struct yiqing
{
    char place[20];
    int A, B, C;
};
int main()
{
    struct yiqing a[35] = {
        "台湾", 175150, 0, 1156291,
        "上海", 90, 773, 62521,
        "香港", 87, 0, 331881,
        "北京", 51, 12, 2975,
        "四川", 20, 107, 2232,
        "福建", 9, 0, 3163,
        "天津", 8, 11, 1843,
        "河南", 4, 25, 3159,
        "广东", 3, 18, 7274,
        "吉林", 2, 9, 40284,
        "江苏", 2, 0, 2220,
        "广西", 2, 17, 1613,
        "云南", 1, 2, 2133,
        "辽宁", 1, 3, 1671,
        "湖北", 0, 1, 68398,
        "陕西", 0, 0, 3278,
        "浙江", 0, 4, 3133,
        "黑龙江", 0, 0, 2983,
        "山东", 0, 1, 2735,
        "河北", 0, 0, 2004,
        "内蒙古", 0, 0, 1753,
        "湖南", 0, 0, 1393,
        "江西", 0, 1, 1383,
        "安徽", 0, 6, 1065,
        "新疆", 0, 0, 1008,
        "重庆", 0, 0, 708,
        "甘肃", 0, 0, 681,
        "山西", 0, 0, 420,
        "海南", 0, 0, 288,
        "贵州", 0, 0, 185,
        "青海", 0, 0, 147,
        "宁夏", 0, 0, 122,
        "澳门", 0, 0, 82,
        "西藏", 0, 0, 1},
                  t;
    int n, i, j;
    char q;
    scanf("%c%d", &q, &n);
    if (n > 34)
        printf("NO");
    if (q == 'A')
    {
        for (i = 0; i < 34; i++)
        {
            for (j = 34; j > i; j--)
            {
                if (a[j].A > a[j - 1].A)
                {
                    t = a[j];
                    a[j] = a[j - 1];
                    a[j - 1] = t;
                }
            }
        }
        printf("%d,%d,%d", a[n - 1].A, a[n - 1].B, a[n - 1].C);
    }
    if (q == 'B')
    {
        for (i = 0; i < 34; i++)
        {
            for (j = 34; j > i; j--)
            {
                if (a[j].B > a[j - 1].B)
                {
                    t = a[j];
                    a[j] = a[j - 1];
                    a[j - 1] = t;
                }
            }
        }
        printf("%d,%d,%d", a[n - 1].A, a[n - 1].B, a[n - 1].C);
    }
    if (q == 'C')
    {
        for (i = 0; i < 34; i++)
        {
            for (j = 34; j > i; j--)
            {
                if (a[j].C > a[j - 1].C)
                {
                    t = a[j];
                    a[j] = a[j - 1];
                    a[j - 1] = t;
                }
            }
        }
        printf("%d,%d,%d", a[n - 1].A, a[n - 1].B, a[n - 1].C);
    }
    return 0;
}